InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Работает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСПерсоналомСервер/Ext/Module.bsl
Функция ПолучитьОкладНаДату (Сотрудник, ГрафикРаботы, ДатаОклада) Экспорт          	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Оклад КАК Оклад
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
	|			&Период,
	|			Сотрудник = &Сотрудник
	|				И ГрафикРаботы = &ГрафикРаботы) КАК КадроваяИсторияСотрудниковСрезПоследних"; 
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", ДатаОклада);
	Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдены данные по данному сотруднику!");
		возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();  
	
	Выборка.Следующий();
	
	Возврат Выборка.Оклад; 
	
КонецФункции           

Функция ПолучитьСписокСотрудниковНаДату (Дата) Экспорт          
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Период, Работает = ИСТИНА) КАК КадроваяИсторияСотрудниковСрезПоследних"; 
	
	Запрос.УстановитьПараметр("Период", Дата);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдены данные на данную дату!");
		возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();  
	
	Выборка.Следующий();
	
	Возврат Выборка; 
	
КонецФункции

Функция ПолучитьИнформациюПОСотрудникамНаДату (Дата) Экспорт          
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	               |	КадроваяИсторияСотрудниковСрезПоследних.Работает КАК Работает,
	               |	КадроваяИсторияСотрудниковСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	               |	КадроваяИсторияСотрудниковСрезПоследних.Оклад КАК Оклад
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Период, Работает = ИСТИНА) КАК КадроваяИсторияСотрудниковСрезПоследних"; 
	
	Запрос.УстановитьПараметр("Период", Дата);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдены данные на данную дату!");
		возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();  
	
	Выборка.Следующий();
	
	Возврат Выборка; 
	
КонецФункции
